SpuerGo/Lowcost-smartlock/SmartLock.cydsn/Generated_Source/PSoC6/SCB.h
/***************************************************************************//**
* \file SCB.c
* \version 2.0
*
*  This file provides constants and parameter values for the EZI2C component.
*
********************************************************************************
* \copyright
* Copyright 2016-2017, Cypress Semiconductor Corporation. All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/

#if !defined(SCB_CY_SCB_EZI2C_PDL_H)
#define SCB_CY_SCB_EZI2C_PDL_H

#include "cyfitter.h"
#include "scb/cy_scb_ezi2c.h"

#if defined(__cplusplus)
extern "C" {
#endif

/***************************************
*   Initial Parameter Constants
****************************************/

#define SCB_ENABLE_SECOND_ADDR  (0U)


/***************************************
*        Function Prototypes
***************************************/
/**
* \addtogroup group_general
* @{
*/
/* Component only APIs. */
void SCB_Start(void);

/* Basic functions. */
__STATIC_INLINE cy_en_scb_ezi2c_status_t SCB_Init(cy_stc_scb_ezi2c_config_t const *config);
__STATIC_INLINE void SCB_DeInit (void);
__STATIC_INLINE void SCB_Enable (void);
__STATIC_INLINE void SCB_Disable(void);

__STATIC_INLINE uint32_t SCB_GetActivity(void);

/* Configuration functions for address 1 */
__STATIC_INLINE void     SCB_SetAddress1(uint8_t addr);
__STATIC_INLINE uint32_t SCB_GetAddress1(void);
__STATIC_INLINE void     SCB_SetBuffer1(uint8_t* buffer, uint32_t size, uint32_t rwBoundary);

#if (SCB_ENABLE_SECOND_ADDR)
/* Configuration functions for address 2 */
__STATIC_INLINE void     SCB_SetAddress2(uint8_t addr);
__STATIC_INLINE uint32_t SCB_GetAddress2(void);
__STATIC_INLINE void     SCB_SetBuffer2(uint8_t* buffer, uint32_t size, uint32_t rwBoundary);
#endif /* (SCB_ENABLE_SECOND_ADDR) */

__STATIC_INLINE void SCB_Interrupt(void);
/** @} group_general */


/***************************************
*    Variables with External Linkage
***************************************/
/**
* \addtogroup group_globals
* @{
*/
extern uint8_t SCB_initVar;
extern cy_stc_scb_ezi2c_config_t const SCB_config;
extern cy_stc_scb_ezi2c_context_t SCB_context;
/** @} group_globals */


/***************************************
*         Preprocessor Macros
***************************************/
/**
* \addtogroup group_macros
* @{
*/
/** The pointer to the base address of the SCB instance */
#define SCB_HW     ((CySCB_Type *) SCB_SCB__HW)
/** @} group_macros */


/***************************************
*    In-line Function Implementation
***************************************/

/*******************************************************************************
* Function Name: SCB_Init
****************************************************************************//**
*
* Invokes the Cy_SCB_EZI2C_Init() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE cy_en_scb_ezi2c_status_t SCB_Init(cy_stc_scb_ezi2c_config_t const *config)
{
    return Cy_SCB_EZI2C_Init(SCB_HW, config, &SCB_context);
}


/*******************************************************************************
*  Function Name: SCB_DeInit
****************************************************************************//**
*
* Invokes the Cy_SCB_EZI2C_DeInit() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void SCB_DeInit(void)
{
    Cy_SCB_EZI2C_DeInit(SCB_HW);
}


/*******************************************************************************
* Function Name: SCB_Enable
****************************************************************************//**
*
* Invokes the Cy_SCB_EZI2C_Enable() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void SCB_Enable(void)
{
    Cy_SCB_EZI2C_Enable(SCB_HW);
}


/*******************************************************************************
* Function Name: SCB_Disable
****************************************************************************//**
*
* Invokes the Cy_SCB_EZI2C_Disable() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void SCB_Disable(void)
{
    Cy_SCB_EZI2C_Disable(SCB_HW, &SCB_context);
}


/*******************************************************************************
* Function Name: SCB_GetActivity
****************************************************************************//**
*
* Invokes the Cy_SCB_EZI2C_GetActivity() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE uint32_t SCB_GetActivity(void)
{
    return Cy_SCB_EZI2C_GetActivity(SCB_HW, &SCB_context);
}


/*******************************************************************************
* Function Name: SCB_SetAddress1
****************************************************************************//**
*
* Invokes the Cy_SCB_EZI2C_SetAddress1() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void SCB_SetAddress1(uint8_t addr)
{
    Cy_SCB_EZI2C_SetAddress1(SCB_HW, addr, &SCB_context);
}


/*******************************************************************************
* Function Name: SCB_GetAddress1
****************************************************************************//**
*
* Invokes the Cy_SCB_EZI2C_GetAddress1() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE uint32_t SCB_GetAddress1(void)
{
    return Cy_SCB_EZI2C_GetAddress1(SCB_HW, &SCB_context);
}


/*******************************************************************************
* Function Name: SCB_SetBuffer1
****************************************************************************//**
*
* Invokes the Cy_SCB_EZI2C_SetBuffer1() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void SCB_SetBuffer1(uint8_t* buffer, uint32_t size, uint32_t rwBoundary)
{
    Cy_SCB_EZI2C_SetBuffer1(SCB_HW, buffer, size, rwBoundary, &SCB_context);
}


#if (SCB_ENABLE_SECOND_ADDR)
/*******************************************************************************
* Function Name: SCB_SetAddress2
****************************************************************************//**
*
* Invokes the Cy_SCB_EZI2C_SlaveGetAddress2() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void SCB_SetAddress2(uint8_t addr)
{
    Cy_SCB_EZI2C_SetAddress2(SCB_HW, addr, &SCB_context);
}


/*******************************************************************************
* Function Name: SCB_GetAddress2
****************************************************************************//**
*
* Invokes the Cy_SCB_EZI2C_SlaveGetAddress2() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE uint32_t SCB_GetAddress2(void)
{
    return Cy_SCB_EZI2C_GetAddress2(SCB_HW, &SCB_context);
}


/*******************************************************************************
* Function Name: SCB_SetBuffer2
****************************************************************************//**
*
* Invokes the Cy_SCB_EZI2C_SetBuffer2() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void SCB_SetBuffer2(uint8_t* buffer, uint32_t size, uint32_t rwBoundary)
{
    Cy_SCB_EZI2C_SetBuffer2(SCB_HW, buffer, size, rwBoundary, &SCB_context);
}
#endif /* (SCB_ENABLE_SECOND_ADDR) */


/*******************************************************************************
* Function Name: SCB_Interrupt
****************************************************************************//**
*
* Invokes the Cy_SCB_EZI2C_Interrupt() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void SCB_Interrupt(void)
{
    Cy_SCB_EZI2C_Interrupt(SCB_HW, &SCB_context);
}

#if defined(__cplusplus)
}
#endif

#endif /* SCB_CY_SCB_EZI2C_PDL_H */


/* [] END OF FILE */
